// let a = [1,2,3,4,5,6]
// let b = {name: 'Alex'}

// console.log(typeof a); object
// console.log(typeof b); object

//---------------------------------------
// Сравнение объектов

// let a = [1,2,3]
// let b = [1,2,3]

// При сравнении массива мы сравниваем ссылку в ячейке области памяти
// console.log(a === b); 
// false


//----------------------------------
// Переменная а и b фактически являються одним и тем же массивом
// Переменная b являються новым ярлыком массива а

// Попытка создании копии массива
// let a = [1,2,3]
// let b = a

// a.push(4)
// b.splice(0,2)

// console.log(a);
// console.log(b);

//-------------------------------------
// Копия массива
let a = [1,2,3]
let b = [...a]
a.push(4)

console.log(a);
console.log(b);